/*********************************************************************************************************
*FileName:	Com.h
*Processor: zigbee RF MCU
*Complier:	IAR |KEIL |AVR GCC|HT-TECH
*Company:   WWW.OURZIGBEE.COM
**********************************************************************************************************
*Author			Date				Comment
*LXP			2011/12/21			Original
*********************************************************************************************************/
#ifndef _COM_H_
#define _COM_H_
/********************************************************************************************************

********************************************************************************************************/
#include "comdef.h"
#include "rf.h"

#include "SAps.h"
#include "SProtocol.h"
/********************************************************************************************************/
/**< 二级数据格式命令 */
/**
D2P == DECEIVE_TO_PC
P2D == PC_TO_DECEIVE */
//--------------------------------------------------------------------------------------------------------
/**<  PC 下行数据 */
#define COM_P2D_RF_MSG_CMD              (0xD0)                          /**< 无线通讯信息命令 */
#define COM_P2D_LF_RF_MSG_CMD           (0xD1)                          /**< 低频无线通讯信息命令 */

#define COM_P2D_SET_ADDR_CMD            (0xE0)                          /**< 串口设置地址命令 */
#define COM_P2D_RF_SET_ADDR_CMD         (0xE1)                          /**< 无线设置地址命令 */
#define COM_P2D_GET_NWK_TOPOLOGY_CMD    (0xE2)                          /**< 获取网络拓扑命令 */
#define COM_P2D_RESET_DECEIVE_CMD       (0xE3)                          /**< 设备复位命令 */
#define COM_P2D_GET_HDW_VER		        (0xE4)							/**< 获取硬件版本命令 */

#define COM_P2D_GET_ADDR_CMD            (0xE9)                          /**< 串口获取地址 */
/**<  PC 上行数据 */
#define COM_D2P_RF_MSG_CMD              (COM_P2D_RF_MSG_CMD)            /**< 回复无线通讯信息命令 */
#define COM_D2P_LF_RF_MSG_CMD           (COM_P2D_LF_RF_MSG_CMD)         /**< 回复低频无线通讯信息命令 */

#define COM_D2P_SET_ADDR_CMD            (COM_P2D_SET_ADDR_CMD)          /**< 回复串口设置地址命令 */
#define COM_D2P_RF_SET_ADDR_CMD         (COM_P2D_RF_SET_ADDR_CMD)       /**< 回复无线设置地址命令 */
#define COM_D2P_GET_NWK_TOPOLOGY_CMD    (COM_P2D_GET_NWK_TOPOLOGY_CMD)  /**< 回复获取网络拓扑命令 */    
#define COM_D2P_RESET_DECEIVE_CMD       (COM_P2D_RESET_DECEIVE_CMD)     /**< 回复设备复位命令 */
#define COM_D2P_GET_HDW_VER		        (COM_P2D_GET_HDW_VER)		    /**< 回复获取硬件版本命令*/

#define COM_D2P_GET_ADDR_CMD            (COM_P2D_GET_ADDR_CMD)        	/**< 回复串口获取地址 */
//========================================================================================================
/**< 一级数据格式命令 */
#define SERIAL_PC_TX_CMD                (0xF1)                          /**< PC下发一级格式命令 */
#define SERIAL_PC_RX_CMD                (0xF2)                          /**< PC接收一级格式命令 */
/********************************************************************************************************/
/**< 串口上发和下发命令的数据格式 */
/**< 
1>一级数据格式：
    1.0xAA+0xF1(下传标示)+数据长度+数据+校验和+0x55
    2.0xAA+0xF2(上传标示)+数据长度+数据+校验和+0x55
2>二级数据格式：
     串口命令*1+RF地址*2+数据包
3>三级数据格式：
    MsgType+TaskID+MsgLen+Msg[MsgLen]
*/

/********************************************************************************************************

********************************************************************************************************/
#define WRITER_SET_RF_MSG_ID   0x0720      /**< 设置频道和地址*/
/********************************************************************************************************

********************************************************************************************************/
typedef struct
{
    uint8   ver;        /**< 版本 */
    uint8   channle;    /**< 信道 */
    uint16  shortAddr;  /**< 短地址 */
}ComSetAddr_t;
/********************************************************************************************************

********************************************************************************************************/
extern void APP_SearilGetTopologyStruct(uint8 len,uint8 *pBuf);
extern void APP_SearilSetAddr(uint8 len,uint8 *pBuf);
extern void APP_SearilGetAddr(uint8 len,uint8 *pBuf);
extern void APP_CoordReceiveMsg(uint8 len,uint8 *pBuf);
extern void APP_SearilReplyHawVer(uint8 len,uint8 *pBuf);
/********************************************************************************************************

********************************************************************************************************/
#endif


