
#include "Font.h"
#include "hal_SPI1.h"
/********************************************************************************************************

********************************************************************************************************/
//#define M_SPI

/********************************************************************************************************
                                     ASCII(竖置横排-纵向取模-字节倒序-宽x高=8x16)  
********************************************************************************************************/
const __code uint8 DzkCode[][16]=              // ASCII
{
    /*--  文字:     --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},

    /*--  文字:  !  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0xF8,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x33,0x30,0x00,0x00,0x00},

    /*--  文字:  "  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x10,0x0C,0x06,0x10,0x0C,0x06,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},

    /*--  文字:  #  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x40,0xC0,0x78,0x40,0xC0,0x78,0x40,0x00,0x04,0x3F,0x04,0x04,0x3F,0x04,0x04,0x00},

    /*--  文字:  $  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x70,0x88,0xFC,0x08,0x30,0x00,0x00,0x00,0x18,0x20,0xFF,0x21,0x1E,0x00,0x00},

    /*--  文字:  %  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0xF0,0x08,0xF0,0x00,0xE0,0x18,0x00,0x00,0x00,0x21,0x1C,0x03,0x1E,0x21,0x1E,0x00},

    /*--  文字:  &  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0xF0,0x08,0x88,0x70,0x00,0x00,0x00,0x1E,0x21,0x23,0x24,0x19,0x27,0x21,0x10},

    /*--  文字:  '  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x10,0x16,0x0E,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},

    /*--  文字:  (  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0xE0,0x18,0x04,0x02,0x00,0x00,0x00,0x00,0x07,0x18,0x20,0x40,0x00},

    /*--  文字:  )  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x02,0x04,0x18,0xE0,0x00,0x00,0x00,0x00,0x40,0x20,0x18,0x07,0x00,0x00,0x00},

    /*--  文字:  *  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x40,0x40,0x80,0xF0,0x80,0x40,0x40,0x00,0x02,0x02,0x01,0x0F,0x01,0x02,0x02,0x00},

    /*--  文字:  +  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0xF0,0x00,0x00,0x00,0x00,0x01,0x01,0x01,0x1F,0x01,0x01,0x01,0x00},

    /*--  文字:  ,  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0xB0,0x70,0x00,0x00,0x00,0x00,0x00},

    /*--  文字:  -  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x01,0x01,0x01,0x01,0x01,0x01},

    /*--  文字:  .  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x30,0x30,0x00,0x00,0x00,0x00,0x00},

    /*--  文字:  /  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x00,0x80,0x60,0x18,0x04,0x00,0x60,0x18,0x06,0x01,0x00,0x00,0x00},

    /*--  文字:  0  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0xE0,0x10,0x08,0x08,0x10,0xE0,0x00,0x00,0x0F,0x10,0x20,0x20,0x10,0x0F,0x00},

    /*--  文字:  1  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x10,0x10,0xF8,0x00,0x00,0x00,0x00,0x00,0x20,0x20,0x3F,0x20,0x20,0x00,0x00},

    /*--  文字:  2  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x70,0x08,0x08,0x08,0x88,0x70,0x00,0x00,0x30,0x28,0x24,0x22,0x21,0x30,0x00},

    /*--  文字:  3  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x30,0x08,0x88,0x88,0x48,0x30,0x00,0x00,0x18,0x20,0x20,0x20,0x11,0x0E,0x00},

    /*--  文字:  4  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0xC0,0x20,0x10,0xF8,0x00,0x00,0x00,0x07,0x04,0x24,0x24,0x3F,0x24,0x00},

    /*--  文字:  5  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0xF8,0x08,0x88,0x88,0x08,0x08,0x00,0x00,0x19,0x21,0x20,0x20,0x11,0x0E,0x00},

    /*--  文字:  6  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0xE0,0x10,0x88,0x88,0x18,0x00,0x00,0x00,0x0F,0x11,0x20,0x20,0x11,0x0E,0x00},

    /*--  文字:  7  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x38,0x08,0x08,0xC8,0x38,0x08,0x00,0x00,0x00,0x00,0x3F,0x00,0x00,0x00,0x00},

    /*--  文字:  8  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x70,0x88,0x08,0x08,0x88,0x70,0x00,0x00,0x1C,0x22,0x21,0x21,0x22,0x1C,0x00},

    /*--  文字:  9  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0xE0,0x10,0x08,0x08,0x10,0xE0,0x00,0x00,0x00,0x31,0x22,0x22,0x11,0x0F,0x00},

    /*--  文字:  :  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0xC0,0xC0,0x00,0x00,0x00,0x00,0x00,0x00,0x30,0x30,0x00,0x00,0x00},

    /*--  文字:  ;  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x80,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x60,0x00,0x00,0x00,0x00},

    /*--  文字:  <  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x80,0x40,0x20,0x10,0x08,0x00,0x00,0x01,0x02,0x04,0x08,0x10,0x20,0x00},

    /*--  文字:  =  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x40,0x40,0x40,0x40,0x40,0x40,0x40,0x00,0x04,0x04,0x04,0x04,0x04,0x04,0x04,0x00},

    /*--  文字:  >  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x08,0x10,0x20,0x40,0x80,0x00,0x00,0x00,0x20,0x10,0x08,0x04,0x02,0x01,0x00},

    /*--  文字:  ?  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x70,0x48,0x08,0x08,0x08,0xF0,0x00,0x00,0x00,0x00,0x30,0x36,0x01,0x00,0x00},

    /*--  文字:  @  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0xC0,0x30,0xC8,0x28,0xE8,0x10,0xE0,0x00,0x07,0x18,0x27,0x24,0x23,0x14,0x0B,0x00},

    /*--  文字:  A  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0xC0,0x38,0xE0,0x00,0x00,0x00,0x20,0x3C,0x23,0x02,0x02,0x27,0x38,0x20},

    /*--  文字:  B  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x88,0x88,0x88,0x70,0x00,0x00,0x20,0x3F,0x20,0x20,0x20,0x11,0x0E,0x00},

    /*--  文字:  C  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0xC0,0x30,0x08,0x08,0x08,0x08,0x38,0x00,0x07,0x18,0x20,0x20,0x20,0x10,0x08,0x00},

    /*--  文字:  D  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x08,0x08,0x08,0x10,0xE0,0x00,0x20,0x3F,0x20,0x20,0x20,0x10,0x0F,0x00},

    /*--  文字:  E  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x88,0x88,0xE8,0x08,0x10,0x00,0x20,0x3F,0x20,0x20,0x23,0x20,0x18,0x00},

    /*--  文字:  F  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x88,0x88,0xE8,0x08,0x10,0x00,0x20,0x3F,0x20,0x00,0x03,0x00,0x00,0x00},

    /*--  文字:  G  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0xC0,0x30,0x08,0x08,0x08,0x38,0x00,0x00,0x07,0x18,0x20,0x20,0x22,0x1E,0x02,0x00},

    /*--  文字:  H  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x08,0x00,0x00,0x08,0xF8,0x08,0x20,0x3F,0x21,0x01,0x01,0x21,0x3F,0x20},

    /*--  文字:  I  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x08,0x08,0xF8,0x08,0x08,0x00,0x00,0x00,0x20,0x20,0x3F,0x20,0x20,0x00,0x00},

    /*--  文字:  J  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x08,0x08,0xF8,0x08,0x08,0x00,0xC0,0x80,0x80,0x80,0x7F,0x00,0x00,0x00},

    /*--  文字:  K  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x88,0xC0,0x28,0x18,0x08,0x00,0x20,0x3F,0x20,0x01,0x26,0x38,0x20,0x00},

    /*--  文字:  L  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x08,0x00,0x00,0x00,0x00,0x00,0x20,0x3F,0x20,0x20,0x20,0x20,0x30,0x00},

    /*--  文字:  M  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0xF8,0x00,0xF8,0xF8,0x08,0x00,0x20,0x3F,0x00,0x3F,0x00,0x3F,0x20,0x00},

    /*--  文字:  N  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x30,0xC0,0x00,0x08,0xF8,0x08,0x20,0x3F,0x20,0x00,0x07,0x18,0x3F,0x00},

    /*--  文字:  O  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0xE0,0x10,0x08,0x08,0x08,0x10,0xE0,0x00,0x0F,0x10,0x20,0x20,0x20,0x10,0x0F,0x00},

    /*--  文字:  P  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x08,0x08,0x08,0x08,0xF0,0x00,0x20,0x3F,0x21,0x01,0x01,0x01,0x00,0x00},

    /*--  文字:  Q  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0xE0,0x10,0x08,0x08,0x08,0x10,0xE0,0x00,0x0F,0x18,0x24,0x24,0x38,0x50,0x4F,0x00},

    /*--  文字:  R  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x88,0x88,0x88,0x88,0x70,0x00,0x20,0x3F,0x20,0x00,0x03,0x0C,0x30,0x20},

    /*--  文字:  S  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x70,0x88,0x08,0x08,0x08,0x38,0x00,0x00,0x38,0x20,0x21,0x21,0x22,0x1C,0x00},

    /*--  文字:  T  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x18,0x08,0x08,0xF8,0x08,0x08,0x18,0x00,0x00,0x00,0x20,0x3F,0x20,0x00,0x00,0x00},

    /*--  文字:  U  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x08,0x00,0x00,0x08,0xF8,0x08,0x00,0x1F,0x20,0x20,0x20,0x20,0x1F,0x00},

    /*--  文字:  V  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0x78,0x88,0x00,0x00,0xC8,0x38,0x08,0x00,0x00,0x07,0x38,0x0E,0x01,0x00,0x00},

    /*--  文字:  W  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0xF8,0x08,0x00,0xF8,0x00,0x08,0xF8,0x00,0x03,0x3C,0x07,0x00,0x07,0x3C,0x03,0x00},

    /*--  文字:  X  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0x18,0x68,0x80,0x80,0x68,0x18,0x08,0x20,0x30,0x2C,0x03,0x03,0x2C,0x30,0x20},

    /*--  文字:  Y  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0x38,0xC8,0x00,0xC8,0x38,0x08,0x00,0x00,0x00,0x20,0x3F,0x20,0x00,0x00,0x00},

    /*--  文字:  Z  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x10,0x08,0x08,0x08,0xC8,0x38,0x08,0x00,0x20,0x38,0x26,0x21,0x20,0x20,0x18,0x00},

    /*--  文字:  [  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0xFE,0x02,0x02,0x02,0x00,0x00,0x00,0x00,0x7F,0x40,0x40,0x40,0x00},

    /*--  文字:  \  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x0C,0x30,0xC0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x06,0x38,0xC0,0x00},

    /*--  文字:  ]  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x02,0x02,0x02,0xFE,0x00,0x00,0x00,0x00,0x40,0x40,0x40,0x7F,0x00,0x00,0x00},

    /*--  文字:  ^  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x04,0x02,0x02,0x02,0x04,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},

    /*--  文字:  _  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80},

    /*--  文字:  `  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x02,0x02,0x04,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},

    /*--  文字:  a  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x19,0x24,0x22,0x22,0x22,0x3F,0x20},

    /*--  文字:  b  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x00,0x80,0x80,0x00,0x00,0x00,0x00,0x3F,0x11,0x20,0x20,0x11,0x0E,0x00},

    /*--  文字:  c  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x80,0x80,0x80,0x00,0x00,0x00,0x0E,0x11,0x20,0x20,0x20,0x11,0x00},

    /*--  文字:  d  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x80,0x80,0x88,0xF8,0x00,0x00,0x0E,0x11,0x20,0x20,0x10,0x3F,0x20},

    /*--  文字:  e  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x1F,0x22,0x22,0x22,0x22,0x13,0x00},

    /*--  文字:  f  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x80,0x80,0xF0,0x88,0x88,0x88,0x18,0x00,0x20,0x20,0x3F,0x20,0x20,0x00,0x00},

    /*--  文字:  g  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x6B,0x94,0x94,0x94,0x93,0x60,0x00},

    /*--  文字:  h  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x00,0x80,0x80,0x80,0x00,0x00,0x20,0x3F,0x21,0x00,0x00,0x20,0x3F,0x20},

    /*--  文字:  i  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x80,0x98,0x98,0x00,0x00,0x00,0x00,0x00,0x20,0x20,0x3F,0x20,0x20,0x00,0x00},

    /*--  文字:  j  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x80,0x98,0x98,0x00,0x00,0x00,0xC0,0x80,0x80,0x80,0x7F,0x00,0x00},

    /*--  文字:  k  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x08,0xF8,0x00,0x00,0x80,0x80,0x80,0x00,0x20,0x3F,0x24,0x02,0x2D,0x30,0x20,0x00},

    /*--  文字:  l  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x08,0x08,0xF8,0x00,0x00,0x00,0x00,0x00,0x20,0x20,0x3F,0x20,0x20,0x00,0x00},

    /*--  文字:  m  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0x20,0x3F,0x20,0x00,0x3F,0x20,0x00,0x3F},

    /*--  文字:  n  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x80,0x80,0x00,0x80,0x80,0x80,0x00,0x00,0x20,0x3F,0x21,0x00,0x00,0x20,0x3F,0x20},

    /*--  文字:  o  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x1F,0x20,0x20,0x20,0x20,0x1F,0x00},

    /*--  文字:  p  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x80,0x80,0x00,0x80,0x80,0x00,0x00,0x00,0x80,0xFF,0xA1,0x20,0x20,0x11,0x0E,0x00},

    /*--  文字:  q  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x00,0x00,0x0E,0x11,0x20,0x20,0xA0,0xFF,0x80},

    /*--  文字:  r  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x80,0x80,0x80,0x00,0x80,0x80,0x80,0x00,0x20,0x20,0x3F,0x21,0x20,0x00,0x01,0x00},

    /*--  文字:  s  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x33,0x24,0x24,0x24,0x24,0x19,0x00},

    /*--  文字:  t  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x80,0x80,0xE0,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x1F,0x20,0x20,0x00,0x00},

    /*--  文字:  u  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x80,0x80,0x00,0x00,0x00,0x80,0x80,0x00,0x00,0x1F,0x20,0x20,0x20,0x10,0x3F,0x20},

    /*--  文字:  v  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x80,0x80,0x80,0x00,0x00,0x80,0x80,0x80,0x00,0x01,0x0E,0x30,0x08,0x06,0x01,0x00},

    /*--  文字:  w  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x80,0x80,0x00,0x80,0x00,0x80,0x80,0x80,0x0F,0x30,0x0C,0x03,0x0C,0x30,0x0F,0x00},

    /*--  文字:  x  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x80,0x80,0x00,0x80,0x80,0x80,0x00,0x00,0x20,0x31,0x2E,0x0E,0x31,0x20,0x00},

    /*--  文字:  y  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x80,0x80,0x80,0x00,0x00,0x80,0x80,0x80,0x80,0x81,0x8E,0x70,0x18,0x06,0x01,0x00},

    /*--  文字:  z  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x21,0x30,0x2C,0x22,0x21,0x30,0x00},

    /*--  文字:  {  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x00,0x80,0x7C,0x02,0x02,0x00,0x00,0x00,0x00,0x00,0x3F,0x40,0x40},

    /*--  文字:  |  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x00,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0x00,0x00,0x00},

    /*--  文字:  }  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x02,0x02,0x7C,0x80,0x00,0x00,0x00,0x00,0x40,0x40,0x3F,0x00,0x00,0x00,0x00},

    /*--  文字:  ~  --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x06,0x01,0x01,0x02,0x02,0x04,0x04,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00},

    /*--  文字:    --*/
    /*--  宋体12;  此字体下对应的点阵为：宽x高=8x16   --*/
    {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00}
};
/********************************************************************************************************
                                模拟SPI读写
********************************************************************************************************/
uint8 SPI_Read(void);
void SPI_Write(uint32 xbyte);
/********************************************************************************************************

********************************************************************************************************/
#define GT20L16S1Y  0xFC        //"啊"字的数据第3个字节
#define GT21L16S2W  0x0E        //"啊"字的数据第3个字节
uint8 FontChip = GT21L16S2W;
/********************************************************************************************************
                               字库初始化(先读取一个字判断是哪一种字库芯片)
********************************************************************************************************/
void FONT_Init(void)
{
    uint8 i,TestChip[3]	= "啊 ";
    
    FONT_CS = 0;

    SPI_Write(FONT_GB2312Addr(TestChip,TYPE_16));
    for(i=0; i<32; i++)
    {
        FontChip = SPI_Read();
        if(i==2)
        {
            break;
        }
    }
    FONT_CS = 1;
}
/********************************************************************************************************
                                            软件延时
********************************************************************************************************/
void delay(int16 i)
{
    while(i--)
    {
        asm("nop");
        asm("nop");
        asm("nop");
    }
}
/********************************************************************************************************

********************************************************************************************************/
void SPI_Write(uint32 xbyte)
{
#ifdef M_SPI    
  	uint8 i;
    xbyte |= 0x03000000;
    
	for(i=32; i!=0; i--)
	{
		FONT_SCLK=0;
		if(xbyte & 0x80000000)
		{
			FONT_MOSI=1;
		}
		else
		{
			FONT_MOSI=0;
		}
		xbyte <<= 1;	
        //delay(3);
        asm("nop");
		FONT_SCLK=1;
		//delay(3);
		asm("nop");
	}	
#else
    SPI_WriteReadData(0x03);
    SPI_WriteReadData((uint8)(xbyte>>16));
    SPI_WriteReadData((uint8)(xbyte>>8));
    SPI_WriteReadData((uint8)(xbyte));
#endif
    
}
/********************************************************************************************************

********************************************************************************************************/
uint8 SPI_Read(void)
{
#ifdef M_SPI       
	uint8 ybyte=0x00, i;

	FONT_SCLK=1;
	for(i=0; i<8; ++i)
	{
		ybyte <<= 1;		//left-shift here due to decrementing operator
		FONT_SCLK=0;
		//delay(3);
		asm("nop");
		if(FONT_MISO)	    //append 1 to ybyte if DO=1
		{
			ybyte |= 0x01;	
		}
		else				//else, append 0 to ybyte
		{
			ybyte &= 0xFE;	
		}

		FONT_SCLK=1;
		//delay(3);
		asm("nop");

		//fast processors may need a delay here
	}
	return(ybyte);
#else
    return SPI_WriteReadData(0x00);
#endif
}
/********************************************************************************************************
                                                字库字符寻址
********************************************************************************************************/
uint32  FONT_GB2312Addr(uint8 *ss,uint8 type)
{
	uint32 temp = 0;
	uint8 c1,c2;
	//ascii  半角字符
	if(ss[0]<0x80)
	{
		if( ss[0] < ' ' )
		{
			ss[0] = ' ';
		}
		temp = ss[0] - ' ';
		if( type == TYPE_8 )
		{
			temp = temp*8 +ASC0808D2HZ_ADDR;  //GT21L16S2W或GT20L16S1Y 7*8 ASCII字符
		}
		else if( type == TYPE_12 )
		{
			temp = temp*12 + ASC0812M2ZF_ADDR; //GT21L16S2W 6*12 ASCII字符
		}
		else if( type == TYPE_16 )   //GT20L16S1Y 8*16 ASCII粗体字符
		{
			temp = temp*16 + 0x3cf80;//粗体//0x3b7c0//普通;//GBEX0816ZF_ADDR;  /* 0x3b7c0 */
		}
	}
	else //chinese tab zone
	{
		c1=ss[0];
		c2=ss[1];
		//符号区,全角
		if(c1 >= 0xA1 && c1 <= 0xAB && c2 >= 0xa1)
		{

			if( type == TYPE_12 )  //GT21L16S2W 11*12汉字
			{
				if( c1 >= 0xA1 && c1 <= 0xA3 && c2>=0xa1 )//ZF 272 ZONE
				{
					temp = (c1 - 0xA1) * 94 + (c2 - 0xA1);
				}
				if( c1 == 0xa9 && c2 >= 0xa1  )//tab 94 zone
				{
					temp = 282 + ( c2 - 0xA1 );
				}
				return( temp *24 + ZF1112B2ZF_ADDR);
			}
			else  //GT20L16S1Y 15*16
			{
				temp = (c1 - 0xA1) * 94 + (c2 - 0xA1);
				return(temp *32 + CUTS1516ZF_ADDR);
			}

		}
		//GBK双字节2区 6768
		else if(c1>=0xb0 && c1 <= 0xf7 && c2>=0xa1)
		{
			temp= (c1 - 0xB0) * 94 + (c2 - 0xA1);
			if( type == TYPE_12 )
			{
				temp = temp*24 + HZ1112B2HZ_ADDR;  //GT21L16S2W 11*12 汉字字符
			}
			else if( type == TYPE_16 )
			{
				temp = temp*32 + JFLS1516HZ_ADDR;  //GT20L16S1Y 15*16 汉字字符
			}
		}
	}
	return temp;
}
/********************************************************************************************************
                                          显示字库汉字
********************************************************************************************************/
void FONT_ShowHanZi(uint32 addr, uint8 hanzipage, uint8 hanzifont,uint8 of,uint16 fcolor,uint16 bcolor)  
{
    uint8 i,n,j,Font;
	//uint8 i;
    uint8 Name[]= {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}; // Welcome Ourzigbee!
    uint8 Univ[]= {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
    
    FONT_CS = 0;
    
    SPI_Write(addr);            //写指令和地址
    for(i=0; i<32; i++)
    {
        Univ[i]=SPI_Read();     //将数据读出付给Univ数组中
    }
    
    FONT_CS = 1;
    
    if(FontChip == GT21L16S2W)
    {
        //+++++++++++++++++++++++++++++++++字库映射++++++++++++++++++++++++++++//
        for( i=0; i<15;  )
        {
            Name[0] = Name[0] | (BB(UINT8BIT7(Univ[i])) << (i/2));
            Name[1] = Name[1] | (BB(UINT8BIT6(Univ[i])) << (i/2));
            Name[2] = Name[2] | (BB(UINT8BIT5(Univ[i])) << (i/2));
            Name[3] = Name[3] | (BB(UINT8BIT4(Univ[i])) << (i/2));
            Name[4] = Name[4] | (BB(UINT8BIT3(Univ[i])) << (i/2));
            Name[5] = Name[5] | (BB(UINT8BIT2(Univ[i])) << (i/2));
            Name[6] = Name[6] | (BB(UINT8BIT1(Univ[i])) << (i/2));
            Name[7] = Name[7] | (BB(UINT8BIT0(Univ[i])) << (i/2));
            i = i+2;
        }
        for( i=1; i<16;  )
        {
            Name[8]  = Name[8]  | (BB(UINT8BIT7(Univ[i])) << ((i-1)/2));
            Name[9]  = Name[9]  | (BB(UINT8BIT6(Univ[i])) << ((i-1)/2));
            Name[10] = Name[10] | (BB(UINT8BIT5(Univ[i])) << ((i-1)/2));
            Name[11] = Name[11] | (BB(UINT8BIT4(Univ[i])) << ((i-1)/2));
            Name[12] = Name[12] | (BB(UINT8BIT3(Univ[i])) << ((i-1)/2));
            Name[13] = Name[13] | (BB(UINT8BIT2(Univ[i])) << ((i-1)/2));
            Name[14] = Name[14] | (BB(UINT8BIT1(Univ[i])) << ((i-1)/2));
            Name[15] = Name[15] | (BB(UINT8BIT0(Univ[i])) << ((i-1)/2));
    
    
            i = i+2;
        }
        for( i=16; i<31;  )
        {
            Name[16]  = Name[16]  | (BB(UINT8BIT7(Univ[i])) << ((i-16)/2));
            Name[17]  = Name[17]  | (BB(UINT8BIT6(Univ[i])) << ((i-16)/2));
            Name[18]  = Name[18] | (BB(UINT8BIT5(Univ[i])) << ((i-16)/2));
            Name[19]  = Name[19] | (BB(UINT8BIT4(Univ[i])) << ((i-16)/2));
            Name[20]  = Name[20] | (BB(UINT8BIT3(Univ[i])) << ((i-16)/2));
            Name[21]  = Name[21] | (BB(UINT8BIT2(Univ[i])) << ((i-16)/2));
            Name[22]  = Name[22] | (BB(UINT8BIT1(Univ[i])) << ((i-16)/2));
            Name[23]  = Name[23] | (BB(UINT8BIT0(Univ[i])) << ((i-16)/2));
    
    
            i = i+2;
        }
        for( i=17; i<32;  )
        {
            Name[24]  = Name[24]  | (BB(UINT8BIT7(Univ[i])) << ((i-17)/2));
            Name[25]  = Name[25]  | (BB(UINT8BIT6(Univ[i])) << ((i-17)/2));
            Name[26]  = Name[26] | (BB(UINT8BIT5(Univ[i])) << ((i-17)/2));
            Name[27]  = Name[27] | (BB(UINT8BIT4(Univ[i])) << ((i-17)/2));
            Name[28]  = Name[28] | (BB(UINT8BIT3(Univ[i])) << ((i-17)/2));
            Name[29]  = Name[29] | (BB(UINT8BIT2(Univ[i])) << ((i-17)/2));
            Name[30]  = Name[30] | (BB(UINT8BIT1(Univ[i])) << ((i-17)/2));
            Name[31]  = Name[31] | (BB(UINT8BIT0(Univ[i])) << ((i-17)/2));
    
    
            i = i+2;
        }
    }
    else
    {
        for(i=0;i<32;i++)
        {
            Name[i] = Univ[i];
        }
    }


    if(of)
    {
	#if 1
        
        if(SysSetStoreValue.DisMode == 0)
        {
            /**< 上下分别一行 */
            //for(i=0;i<16;i++)
            //{
            //   Name[i]|= 0x01;
            //}
            
            //for(i=16;i<32;i++)
            //{
            //    Name[i]|= 0x80;
            //}
        }
        else if(SysSetStoreValue.DisMode == 1)
        {
            /**< 下面两行 */
            for(i=16;i<32;i++)
            {
                //Name[i]|= 0xC0;
                Name[i]|= 0x80;
            }  
        }
        else if(SysSetStoreValue.DisMode == 2)
        {
            /**< 反白 */
            for(i=0;i<32;i++)
            {
                Name[i] = ~Name[i];
            }
        }
        else
        {
        	for(i=0;i<16;i++)
            {
                Name[i]|= 0x01;
            }
            for(i=16;i<32;i++)
            {
                Name[i]|= 0x80;
            }
            if(of&0x80)
            {
                Name[0] = 0xFF;
                Name[16] = 0xFF;
            }
            else if(of&0x40)
            {
                Name[15] = 0xff;
                Name[31] = 0xff;
            }
        }
	#else

		Name[0] = 0xFF;
		for(i=1;i<16;i++)
		{
			Name[i]|= 0x01;
			//Name[i] = ~Name[i];
		
		}
		Name[16] = 0xFF;
		for(i=17;i<32;i++)
		{
			//Name[i] = ~Name[i];
		
			Name[i]|= 0x80;
		}

		for(i=0;i<32;i++)
		{
			Name[i] = ~Name[i];
		}
	#endif
    }

    for(i=0;i<32;i++)
    {
        n=Name[i];
        if(i < 16)
        {
            LCD_SetStartColumn(hanzifont+i,hanzifont+i);
            LCD_SetStartPage(hanzipage,hanzipage+8);
        }
        else
        {
            LCD_SetStartColumn((hanzifont+(i-16)),(hanzifont+(i-16)));
            LCD_SetStartPage(hanzipage+8,hanzipage+16);
        }

        LCD_WriteCommand(0x2C);
        
        for(j=0;j<8;j++)
        {
            Font=n;
            if(((Font >> j) & 0x01) == 0x01)
            {
                LCD_Write_TwoData(fcolor);    
            }
            else
            {
                LCD_Write_TwoData(bcolor);
            }
        }
    }
}

/********************************************************************************************************
                                   显示字库ASCII码
********************************************************************************************************/
void FONT_ShowAscii(uint32 addr, uint8 hanzipage, uint8 hanzifont,uint8 of,uint16 fcolor,uint16 bcolor)  
{
    uint8 n,i,j,Font;
	//uint8 i;
    uint8 Name[]= {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}; // Welcome Ourzigbee!
    uint8 Univ[]= {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
    
    FONT_CS = 0;
    
    SPI_Write(addr);            //写指令和地址
    for(i=0; i<16; i++)
    {
        Univ[i]=SPI_Read();     //将数据读出付给Univ数组中
    }
    
    FONT_CS = 1;
    
    if(FontChip == GT21L16S2W)
    {    
        //+++++++++++++++++++++++++++++++++字库映射++++++++++++++++++++++++++++//
        for( i=0; i<8;  )
        {
            Name[0] = Name[0] | (BB(UINT8BIT7(Univ[i])) << (i));
            Name[1] = Name[1] | (BB(UINT8BIT6(Univ[i])) << (i));
            Name[2] = Name[2] | (BB(UINT8BIT5(Univ[i])) << (i));
            Name[3] = Name[3] | (BB(UINT8BIT4(Univ[i])) << (i));
            Name[4] = Name[4] | (BB(UINT8BIT3(Univ[i])) << (i));
            Name[5] = Name[5] | (BB(UINT8BIT2(Univ[i])) << (i));
            Name[6] = Name[6] | (BB(UINT8BIT1(Univ[i])) << (i));
            Name[7] = Name[7] | (BB(UINT8BIT0(Univ[i])) << (i));
            i = i+1;
        }

        for( i=8; i<16;  )
        {
            Name[8]  = Name[8]  | (BB(UINT8BIT7(Univ[i])) << (i-8));
            Name[9]  = Name[9]  | (BB(UINT8BIT6(Univ[i])) << (i-8));
            Name[10]  = Name[10] | (BB(UINT8BIT5(Univ[i])) << (i-8));
            Name[11]  = Name[11] | (BB(UINT8BIT4(Univ[i])) << (i-8));
            Name[12]  = Name[12]  | (BB(UINT8BIT3(Univ[i])) << (i-8));
            Name[13]  = Name[13]  | (BB(UINT8BIT2(Univ[i])) << (i-8));
            Name[14]  = Name[14] | (BB(UINT8BIT1(Univ[i])) << (i-8));
            Name[15]  = Name[15] | (BB(UINT8BIT0(Univ[i])) << (i-8));
            i = i+1;
        }
		
		for(i=0;i<16;i++)
        {
            Name[i] = Name[i]<<2;
        }
    }
    else
    {
        for(i=0;i<8;i++)
        {
			Name[i+8] 	= Univ[i+8]<<1;
			if(Univ[i]&0x80)
			{
				Name[i+8] |= 0x01;
			}
			Name[i] 	= Univ[i]<<1;
        }
		
        for(i=0;i<8;i++)
        {
			Name[i+8] 	= Name[i+8]<<1;
			if(Name[i]&0x80)
			{
				Name[i+8] |= 0x01;
			}
			Name[i] 	= Name[i]<<1;
        }
    }

    if(of)
    {
        if(SysSetStoreValue.DisMode == 0)
        {
            /**< 上下分别一行 */
            //for(i=0;i<8;i++)
            //{
            //    Name[i]|= 0x01;
            //}
            
            //for(i=8;i<16;i++)
            //{
            //    Name[i]|= 0x80;
            //}
        }
        else if(SysSetStoreValue.DisMode == 1)
        {
            /**< 下面两行 */
            for(i=8;i<16;i++)
            {
                //Name[i]|= 0xC0;
                Name[i]|= 0x80;
            }
        }
        else if(SysSetStoreValue.DisMode == 2)
        {
            /**< 反白 */
            for(i=0;i<16;i++)
            {
                Name[i] = ~Name[i];
            }
        }
        else
        {
        	for(i=0;i<8;i++)
            {
                Name[i]|= 0x01;
            }
            for(i=8;i<16;i++)
            {
                Name[i]|= 0x80;
            }
            if(of&0x80)
            {
                Name[0] = 0xFF;
                Name[8] = 0xFF;
            }
            else if(of&0x40)
            {
                Name[7] = 0xFF;
                Name[15] = 0xFF;
            }
        }   
    }

    //ASCII码显示
    //竖置横排（GT21L16S1Y）-纵向取模-字节倒序
    for(i=0;i<16;i++)
    {
        n=Name[i];

        if(i < 8)
        {
            LCD_SetStartColumn(hanzifont+i,hanzifont+i);
            LCD_SetStartPage(hanzipage,hanzipage+8);
        }
        else
        {
            LCD_SetStartColumn((hanzifont+(i-8)),(hanzifont+(i-8)));
            LCD_SetStartPage(hanzipage+8,hanzipage+16);
        }

        LCD_WriteCommand(0x2C);
        
        for(j=0;j<8;j++)
        {
            Font=n;
            if(((Font >> j) & 0x01) == 0x01)
            {
                LCD_Write_TwoData(fcolor);    
            }
            else
            {
                LCD_Write_TwoData(bcolor);
            }
        }
    }	
}
/********************************************************************************************************
                                      显示字库ASCII码
********************************************************************************************************/
void FONT_ShowAscii2(uint32 addr, uint8 hanzipage, uint8 hanzifont,uint8 of,uint16 fcolor,uint16 bcolor)  
{
    uint8 n,i,j,Font;
	//uint8 i;
    uint8 Name[]= {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}; // Welcome Ourzigbee!
    uint8 Univ[]= {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
    
    FONT_CS = 0;
    
    SPI_Write(addr);            //写指令和地址
    for(i=0; i<16; i++)
    {
        Univ[i]=SPI_Read();     //将数据读出付给Univ数组中
    }
    
    FONT_CS = 1;
    
    if(FontChip == GT21L16S2W)
    {    
        //+++++++++++++++++++++++++++++++++字库映射++++++++++++++++++++++++++++//
        for( i=0; i<8;  )
        {
            Name[0] = Name[0] | (BB(UINT8BIT7(Univ[i])) << (i));
            Name[1] = Name[1] | (BB(UINT8BIT6(Univ[i])) << (i));
            Name[2] = Name[2] | (BB(UINT8BIT5(Univ[i])) << (i));
            Name[3] = Name[3] | (BB(UINT8BIT4(Univ[i])) << (i));
            Name[4] = Name[4] | (BB(UINT8BIT3(Univ[i])) << (i));
            Name[5] = Name[5] | (BB(UINT8BIT2(Univ[i])) << (i));
            Name[6] = Name[6] | (BB(UINT8BIT1(Univ[i])) << (i));
            Name[7] = Name[7] | (BB(UINT8BIT0(Univ[i])) << (i));
            i = i+1;
        }

        for( i=8; i<16;  )
        {
            Name[8]  = Name[8]  | (BB(UINT8BIT7(Univ[i])) << (i-8));
            Name[9]  = Name[9]  | (BB(UINT8BIT6(Univ[i])) << (i-8));
            Name[10]  = Name[10] | (BB(UINT8BIT5(Univ[i])) << (i-8));
            Name[11]  = Name[11] | (BB(UINT8BIT4(Univ[i])) << (i-8));
            Name[12]  = Name[12]  | (BB(UINT8BIT3(Univ[i])) << (i-8));
            Name[13]  = Name[13]  | (BB(UINT8BIT2(Univ[i])) << (i-8));
            Name[14]  = Name[14] | (BB(UINT8BIT1(Univ[i])) << (i-8));
            Name[15]  = Name[15] | (BB(UINT8BIT0(Univ[i])) << (i-8));
            i = i+1;
        }
		
		for(i=0;i<16;i++)
        {
            Name[i] = Name[i]<<2;
        }
    }
    else
    {
        for(i=0;i<8;i++)
        {
			Name[i+8] 	= Univ[i+8]<<1;
			if(Univ[i]&0x80)
			{
				Name[i+8] |= 0x01;
			}
			Name[i] 	= Univ[i]<<1;
        }
		
        for(i=0;i<8;i++)
        {
			Name[i+8] 	= Name[i+8]<<1;
			if(Name[i]&0x80)
			{
				Name[i+8] |= 0x01;
			}
			Name[i] 	= Name[i]<<1;
        }
    }


    if(of)
    {
        for(i=0;i<16;i++)
        {
            Name[i] = ~Name[i];
        }
    }

    //ASCII码显示
    //竖置横排（GT21L16S1Y）-纵向取模-字节倒序
    for(i=0;i<16;i++)
    {
        n=Name[i];

        if(i < 8)
        {
            LCD_SetStartColumn(hanzifont+i,hanzifont+i);
            LCD_SetStartPage(hanzipage,hanzipage+8);
        }
        else
        {
            LCD_SetStartColumn((hanzifont+(i-8)),(hanzifont+(i-8)));
            LCD_SetStartPage(hanzipage+8,hanzipage+16);
        }

        LCD_WriteCommand(0x2C);
        
        for(j=0;j<8;j++)
        {
            Font=n;
            if(((Font >> j) & 0x01) == 0x01)
            {
                LCD_Write_TwoData(fcolor);    
            }
            else
            {
                LCD_Write_TwoData(bcolor);
            }
        }
    }

}
/********************************************************************************************************

********************************************************************************************************/


